export interface TrackInterface {
  id: number;
  text: string;
  progress: number;
}

const track: Array<TrackInterface> = [
  {
    id: 1,
    text: 'Заримдаа сэтгэл хөдлөл яг гaлзуу хулгана шиг болчихдог.',
    progress: 0,
  },
  {
    id: 2,
    text: `Нэг бол унаж нэг бол хөөрч нэг бол буцаад хэвийн болж, тэгээд ахиад үргэлжилдэг.`,
    progress: 4,
  },
  {
    id: 3,
    text: `Гэхдээ миний бодлоор хүн л юм чинь ийм мэдрэмж төрөх нь хэвийн үзэгдэл байх.`,
    progress: 9,
  },
  {
    id: 4,
    text: `Бид ихэвчлэн хий хоосон зүйлс, үйлдэл, хүмүүсээр өөрийгөө дүүргэж, өөрийгөө сатааруулж асуудлаас зутгаадаг.`,
    progress: 14,
  },
  {
    id: 5,
    text: `Учир нь бид хормын дотор хоосордоггүй`,
    progress: 22,
  },
  {
    id: 6,
    text: `Өглөө сэрэх болгондоо, шөнө унтах болгондоо тэр мэдрэмжийг дахин дахин авдаг.`,
    progress: 24,
  },
  {
    id: 7,
    text: `Тэгээд ганцаараа байхаас, өөрийн бодолтойгоо нүүр тулахаас айж зүгээр л өөрийгөө дүүрхэгийг хүсдэг. `,
    progress: 29,
  },
  {
    id: 8,
    text: `Хүмүүсийн дунд байхад яагад ч юм ганцаараа биш юм шиг санагдаад л.`,
    progress: 35,
  },
  {
    id: 9,
    text: `Гэхдээ харамсалтай нь дахиад л өглөө болно.`,
    progress: 39,
  },
  {
    id: 10,
    text: `Цаг хугацаа зүгээр болгоно гэж хүмүүс хэлдэг ч тэр тэр цаг хугацаанд байдаггүй. `,
    progress: 42,
  },
  {
    id: 11,
    text: `Чиний мэдэрч байгаа цаг хугацаа хамаагүй, бүр хамаагүй, хэд дахин удаан дуусашгүй, эцэс төсгөлгүй мэт мэдрэгддэг.`,
    progress: 47,
  },
  {
    id: 12,
    text: `Энэ үед өөртөө эдгэрэх цаг гаргаж өгөх хэрэгтэй.`,
    progress: 55,
  },
  {
    id: 13,
    text: `Өөртэйгөө ярилцаж, хүлээн зөвшөөрөөд, урагшлах.`,
    progress: 57,
  },

  {
    id: 14,
    text: `Энэ мэдээж хэзээ ч амархан байхгүй. `,
    progress: 61,
  },

  {
    id: 15,
    text: `Чи илүү гүн гүнзгий байх тусам урагшлах гэхлээр илүү их өвдөнө.`,
    progress: 63,
  },
  {
    id: 16,
    text: `Бүх зүйлс нь үзэсгэлэнтэй, үзэн ядах шалтгаан байхгүй байх тусам илүү хүчтэй өвдөнө.`,
    progress: 68,
  },
  {
    id: 17,
    text: `Бодохгүй байхыг хүснэ. `,
    progress: 73,
  },
  {
    id: 18,
    text: `Хүлээн зөвшөөрөхгүй байхыг хүснэ.`,
    progress: 75,
  },
  {
    id: 19,
    text: `Зугтаахыг хүснэ. `,
    progress: 77,
  },
  {
    id: 20,
    text: `Гэхдээ энэ бүхниийг туулахаас өөр арга байхгүй. `,
    progress: 78,
  },
  {
    id: 21,
    text: `Зүгээр л хүлээн зөвшөөръе гэж шийдэхгүй бол болохгүй`,
    progress: 81,
  },
  {
    id: 22,
    text: `Хэн нэгнээр орлуулах гэж битгий завд. `,
    progress: 85,
  },
  {
    id: 23,
    text: `Чи гэм хоргүй тэр хэн нэгнийг зовоох л болно.`,
    progress: 88,
  },
  {
    id: 24,
    text: `Тэгээд магадгүй сар, хагас жил, бүтэн жил өөртөө эдгэрэх цаг өг.`,
    progress: 91,
  },

  {
    id: 25,
    text: `Чамайг сатааруулах зүйлсийг биш чамайг эдгээх зүйлсийг хий.`,
    progress: 95,
  },
  {
    id: 26,
    text: `Би чамайг юу даван туулж, юунаас айж, юуг эсвэл хэнийг алдаж, яаж зовж байгааг мэдэхгүй ч гэсэн ирээдүйд юу болохыг таашгүй ч гэсэн бүх зүйлс сайхан болно.`,
    progress: 100,
  },
  {
    id: 27,
    text: `Хүссэн бүхэн чинь биелж, чи дахиад аз жаргалтай болох өдөр ирнэ.`,
    progress: 111,
  },
  {
    id: 28,
    text: `Магадгүй би өөрөө тэгж итгэхийг хүсэж байгаа байх.`,
    progress: 115,
  },
];

export {track};
